Revit 2027 API
StructuralSettings.UseLoadsDisplayScaling Property
 Whether to use loads display scaling. If disabled then loads are displayed according to force scale type parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseLoadsDisplayScaling { get; set; }
Public Property UseLoadsDisplayScaling As Boolean
	Get
	Set
public:
property bool UseLoadsDisplayScaling {
	bool get ();
	void set (bool value);
}
member UseLoadsDisplayScaling : bool with get, set
Property Value
Boolean
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace